app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Montessori"], ["room_number", 3], ["created_at", "2021-01-23 21:17:10.598398"], ["updated_at", "2021-01-23 21:17:10.598398"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class)
	@school_class.save
	redirect_to school_class_path(@school_class)
  end

  def update
	@school_class = SchoolClass.find(params[:id])
	@school_class.update(params.require(:school_class)
	redirect_to student_path(@school_class)
   end

end